# Задание 1

temp = int(input('Введите текущую температуру воздуха: '))

if temp < 20:
    print('\nКондиционер включился')
else:
    print('\nКондиционер выключился')

