# Задание 1
var_int = 1
var_float = 0.23
var_str = 'string'
var_bool = True

# Задание 2
name = "Максим"
age = 18
print(name, age)
print('')

# Задание 3
var1 = 342
var2 = 56.2
var3 = '43'
print(var1+var2+int(var3))
print('')

# Задание 4
a, b = 3, 8
c = (a + 4*b)*(a - 3*b) + a ** 2

# Задание 5
a = int(input('Введите значение стороны a: '))
b = int(input('Введите значение стороны b: '))
s = a*b
p = 2*(a+b)
print(f'\nПлощадь: {s}\nПериметр: {p}')

# Задание 6
print('\n*   *   *')
print(' * * * *')
print('  *   *\n')

# Задание 7
a = int(input('Введите температуру в градусах цельсия: '))
print(f'Ваша температура в градусах фарингейта: {a*33.8}')
